Repository: Jassy930/FluxDeck
Catalog: apps/desktop-macos-native/FluxDeckNative/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# admin.error.provider_referenced_by_gateways
source: Provider is referenced by gateways: %1$@
zh_hans: 供应商已被网关引用：%1$@

# admin.error.request_failed_http
source: Request failed with HTTP %lld
zh_hans: 请求失败，HTTP %lld

# admin.gateway.notice.deleted
source: Gateway deleted.
zh_hans: Gateway 已删除。

# admin.gateway.notice.deleted_stopped
source: Gateway deleted. The running instance was stopped first.
zh_hans: Gateway 已删除。运行中的实例已先停止。

# admin.gateway.notice.update_saved
source: Gateway configuration saved.
zh_hans: Gateway 配置已保存。

# admin.gateway.notice.update_saved_restart_failed
source: Gateway configuration saved, but restart failed: %1$@
zh_hans: Gateway 配置已保存，但自动重启失败：%1$@

# admin.gateway.notice.update_saved_restarted
source: Gateway configuration saved, and the running instance restarted automatically.
zh_hans: Gateway 配置已保存，运行中的实例已自动重启。

# admin.provider.notice.deleted
source: Provider deleted.
zh_hans: Provider 已删除。

# admin.provider.notice.probe_started
source: Provider %1$@ entered %2$@ state.
zh_hans: Provider %1$@ 已进入 %2$@ 状态。

# common.action.cancel
source: Cancel
zh_hans: 取消

# common.action.configure
source: Configure
zh_hans: 配置

# common.action.delete
source: Delete
zh_hans: 删除

# common.action.edit
source: Edit
zh_hans: 编辑

# common.action.load_more
source: Load More
zh_hans: 加载更多

# common.action.save_changes
source: Save Changes
zh_hans: 保存更改

# common.duration_milliseconds
source: %lld ms
zh_hans: %lld 毫秒

# common.filter.all
source: All
zh_hans: 全部

# common.metric.errors
source: Errors
zh_hans: 错误数

# common.metric.period
source: Period
zh_hans: 周期

# common.metric.requests
source: Requests
zh_hans: 请求数

# common.model_count.one
source: %lld model
zh_hans: %lld 个模型

# common.model_count.other
source: %lld models
zh_hans: %lld 个模型

# common.state.loading
source: Loading…
zh_hans: 加载中…

# common.value.no
source: No
zh_hans: 否

# common.value.yes
source: Yes
zh_hans: 是

# dialog.delete_gateway.message
source: Delete `%1$@` permanently. This does not require deleting its Provider first. If this Gateway is running, the system will stop it before deletion.
zh_hans: 将永久删除 `%1$@`。无需先删除其 Provider；如果该 Gateway 正在运行，系统会先停止它再删除。

# dialog.delete_gateway.title
source: Delete Gateway?
zh_hans: 删除 Gateway？

# dialog.delete_provider.message
source: Delete `%1$@` permanently. If any Gateway still references this Provider, the operation will fail.
zh_hans: 将永久删除 `%1$@`。如果仍有 Gateway 引用这个 Provider，操作会失败。

# dialog.delete_provider.title
source: Delete Provider?
zh_hans: 删除 Provider？

# dialog.delete.action.cancel
source: Cancel
zh_hans: 取消

# dialog.delete.action.delete
source: Delete
zh_hans: 删除

# gateway_form.action.create
source: Create Gateway
zh_hans: 新建 Gateway

# gateway_form.field.default_model
source: Default Model
zh_hans: 默认模型

# gateway_form.field.default_model.caption
source: Optional model hint for clients that omit the model field.
zh_hans: 给省略 model 字段的客户端提供可选默认模型提示。

# gateway_form.field.default_provider
source: Default Provider
zh_hans: 默认 Provider

# gateway_form.field.default_provider.caption
source: Choose the upstream provider that receives unmatched traffic.
zh_hans: 选择接收未命中路由流量的上游 Provider。

# gateway_form.field.display_name
source: Display Name
zh_hans: 显示名称

# gateway_form.field.gateway_id.caption_create
source: Stable local route identifier used by admin workflows.
zh_hans: 供管理工作流使用的稳定本地路由标识。

# gateway_form.field.gateway_id.caption_edit
source: Locked after creation to keep local clients and scripts stable.
zh_hans: 创建后锁定，保证本地客户端与脚本稳定。

# gateway_form.field.inbound_protocol
source: Inbound Protocol
zh_hans: 入口协议

# gateway_form.field.inbound_protocol.caption
source: Client-facing protocol accepted at the local endpoint.
zh_hans: 本地端点对客户端暴露的入口协议。

# gateway_form.field.listen_host
source: Listen Host
zh_hans: 监听地址

# gateway_form.field.listen_host.caption
source: Local bind address for the gateway process.
zh_hans: Gateway 进程绑定的本地地址。

# gateway_form.field.listen_port
source: Listen Port
zh_hans: 监听端口

# gateway_form.field.listen_port.caption
source: Expose a unique local port between 1 and 65535.
zh_hans: 暴露一个 1 到 65535 之间的唯一本地端口。

# gateway_form.field.upstream_protocol
source: Upstream Protocol
zh_hans: 上游协议

# gateway_form.field.upstream_protocol.caption
source: Protocol used when forwarding to the selected provider.
zh_hans: 转发到所选 Provider 时使用的协议。

# gateway_form.footer.auto_start_off
source: Auto Start Off
zh_hans: 自动启动关闭

# gateway_form.footer.auto_start_on
source: Auto Start On
zh_hans: 自动启动开启

# gateway_form.footer.create
source: Create a local gateway profile
zh_hans: 创建本地 Gateway 配置

# gateway_form.footer.update
source: Update local routing and protocol configuration
zh_hans: 更新本地路由与协议配置

# gateway_form.header.create
source: Create Gateway
zh_hans: 新建 Gateway

# gateway_form.header.edit
source: Configure Gateway
zh_hans: 配置 Gateway

# gateway_form.header.subtitle
source: Manage the local endpoint, protocol bridge and default upstream route in one compact control surface.
zh_hans: 在一个紧凑的控制面板中管理本地端点、协议桥接和默认上游路由。

# gateway_form.meta.endpoint
source: Endpoint
zh_hans: 端点

# gateway_form.meta.routing
source: Routing
zh_hans: 路由

# gateway_form.meta.startup
source: Startup
zh_hans: 启动方式

# gateway_form.meta.status
source: Status
zh_hans: 状态

# gateway_form.metric.inbound
source: Inbound
zh_hans: 入口

# gateway_form.metric.upstream
source: Upstream
zh_hans: 上游

# gateway_form.option.current_value
source: Current value: %1$@
zh_hans: 当前值：%1$@

# gateway_form.option.fallback
source: Fallback
zh_hans: 回退

# gateway_form.option.unavailable_provider
source: Unavailable provider
zh_hans: Provider 不可用

# gateway_form.option.unsupported_saved_value
source: Unsupported saved value
zh_hans: 不支持的已保存值

# gateway_form.protocol.provider_default
source: Provider Default
zh_hans: Provider 默认值

# gateway_form.protocol.provider_default.caption
source: Delegate protocol to provider kind
zh_hans: 将协议委托给 Provider 类型

# gateway_form.provider.none_available
source: No providers available
zh_hans: 没有可用的 Provider

# gateway_form.provider.none_yet
source: No providers available yet.
zh_hans: 还没有可用的 Provider。

# gateway_form.provider.unassigned
source: Unassigned
zh_hans: 未分配

# gateway_form.route_targets.add
source: Add Target
zh_hans: 添加目标

# gateway_form.route_targets.backup
source: Backup #%1$lld
zh_hans: 备援 #%1$lld

# gateway_form.route_targets.default
source: Default
zh_hans: 默认

# gateway_form.route_targets.move_down
source: Down
zh_hans: 下移

# gateway_form.route_targets.move_up
source: Up
zh_hans: 上移

# gateway_form.route_targets.picker_provider
source: Route Target Provider
zh_hans: 路由目标 Provider

# gateway_form.route_targets.preview_caption
source: Review the ordered failover chain here. Detailed editing lives in the Routing Targets panel.
zh_hans: 这里展示按顺序生效的故障转移链路，详细编辑请在右侧路由目标面板完成。

# gateway_form.route_targets.preview_title
source: Route Targets
zh_hans: 路由目标

# gateway_form.route_targets.primary
source: Primary
zh_hans: 主目标

# gateway_form.route_targets.primary_hint
source: The first target is always enabled and is mirrored to Default Provider.
zh_hans: 第一个目标始终启用，并会同步映射到默认 Provider。

# gateway_form.routing_json.caption
source: Protocol compatibility and routing overrides are stored with the gateway profile. If this instance is currently running and the configuration changes, FluxDeck will restart it automatically after save.
zh_hans: 协议兼容性和路由覆盖配置会随 Gateway 资料保存。如果当前实例正在运行，保存后 FluxDeck 会自动重启它。

# gateway_form.routing_targets.caption
source: Configure the ordered failover chain used by this gateway. The first target is the active default upstream.
zh_hans: 配置当前 Gateway 使用的有序故障转移链路。第一个目标就是当前生效的默认上游。

# gateway_form.routing.bridge
source: Bridge
zh_hans: 桥接

# gateway_form.routing.direct
source: Direct
zh_hans: 直连

# gateway_form.routing.mapped
source: Mapped
zh_hans: 映射

# gateway_form.runtime.active
source: Active
zh_hans: 启用

# gateway_form.runtime.disabled
source: Disabled
zh_hans: 停用

# gateway_form.runtime.routing_disabled
source: Routing disabled
zh_hans: 路由已关闭

# gateway_form.runtime.routing_enabled
source: Routing enabled
zh_hans: 路由已开启

# gateway_form.runtime.snapshot_caption
source: Quick runtime snapshot for the current gateway profile.
zh_hans: 当前 Gateway 配置的快速运行时快照。

# gateway_form.section.identity
source: Identity
zh_hans: 标识

# gateway_form.section.network_protocols
source: Network & Protocols
zh_hans: 网络与协议

# gateway_form.section.routing_json
source: Routing JSON
zh_hans: 路由 JSON

# gateway_form.section.routing_targets
source: Routing Targets
zh_hans: 路由目标

# gateway_form.section.runtime
source: Runtime
zh_hans: 运行时

# gateway_form.startup.auto_start_on_launch
source: Auto start on fluxd launch
zh_hans: 随 fluxd 启动自动启动

# gateway_form.startup.automatic
source: Automatic
zh_hans: 自动

# gateway_form.startup.manual
source: Manual
zh_hans: 手动

# gateway_form.startup.manual_short
source: Manual startup
zh_hans: 手动启动

# gateway_form.summary.no_endpoint
source: No endpoint configured
zh_hans: 未配置端点

# gateway_form.summary.profile
source: Gateway Profile
zh_hans: Gateway 配置

# gateway_form.summary.snapshot
source: Gateway Snapshot
zh_hans: Gateway 快照

# gateway_form.summary.untitled
source: Untitled Gateway
zh_hans: 未命名 Gateway

# gateway_form.toggle.auto_start
source: Auto Start
zh_hans: 自动启动

# gateway_form.toggle.enabled
source: Enabled
zh_hans: 启用

# gateway_form.validation.default_provider_required
source: Default Provider is required.
zh_hans: 默认 Provider 为必填项。

# gateway_form.validation.id_required
source: ID is required.
zh_hans: ID 为必填项。

# gateway_form.validation.listen_port_invalid
source: Listen Port must be a valid port number (1-65535).
zh_hans: 监听端口必须是合法端口号（1-65535）。

# gateway_form.validation.required_fields
source: Name, Host and Protocols are required.
zh_hans: 名称、地址和协议为必填项。

# gateway_form.validation.review
source: Review the required fields before saving this gateway configuration.
zh_hans: 保存 Gateway 配置前，请检查必填字段。

# gateway_form.validation.routing_json_invalid
source: Routing JSON must be a valid JSON object.
zh_hans: 路由 JSON 必须是合法的 JSON 对象。

# gateway.action.new
source: New Gateway
zh_hans: 新建网关

# gateway.empty.message
source: Create and start a gateway to expose the OpenAI-compatible endpoint.
zh_hans: 创建并启动网关以暴露 OpenAI 兼容端点。

# gateway.empty.title
source: No gateways
zh_hans: 暂无网关

# gateway.page.title
source: Gateways
zh_hans: 网关

# gateway.state.loading
source: Loading gateways...
zh_hans: 正在加载网关...

# gateway.state.submitting_action
source: Applying gateway action...
zh_hans: 正在应用网关操作...

# gateways.actions.applying
source: Applying gateway action...
zh_hans: 正在应用 Gateway 操作...

# gateways.actions.delete
source: Delete
zh_hans: 删除

# gateways.actions.edit
source: Edit
zh_hans: 编辑

# gateways.actions.new
source: New Gateway
zh_hans: 新建 Gateway

# gateways.fields.active_provider
source: Active
zh_hans: 当前活跃

# gateways.fields.auto_start
source: Auto Start
zh_hans: 自动启动

# gateways.fields.endpoint
source: Endpoint
zh_hans: 端点

# gateways.fields.health
source: Health
zh_hans: 健康状态

# gateways.fields.last_error
source: Last Error
zh_hans: 最近错误

# gateways.fields.routes
source: Routes
zh_hans: 路由链

# gateways.health_summary.format
source: %1$lld healthy · %2$lld degraded · %3$lld unhealthy · %4$lld probing
zh_hans: %1$lld 健康 · %2$lld 降级 · %3$lld 不健康 · %4$lld 探测中

# gateways.health_summary.none
source: No health summary
zh_hans: 暂无健康摘要

# gateways.list.empty.message
source: Create and start a gateway to expose the OpenAI-compatible endpoint.
zh_hans: 创建并启动 Gateway 以暴露 OpenAI 兼容端点。

# gateways.list.empty.title
source: No gateways
zh_hans: 暂无 Gateway

# gateways.list.loading
source: Loading gateways...
zh_hans: 正在加载 Gateway...

# gateways.list.title
source: Gateways
zh_hans: Gateway

# gateways.value.idle
source: Idle
zh_hans: 空闲

# logs.actions.load_more
source: Load More
zh_hans: 加载更多

# logs.actions.loading_more
source: Loading…
zh_hans: 加载中…

# logs.compact.cached
source: %1$@ c
zh_hans: %1$@ 缓

# logs.compact.empty
source: Tok -
zh_hans: 令牌 -

# logs.compact.input
source: %1$@ in
zh_hans: %1$@ 入

# logs.compact.output
source: %1$@ out
zh_hans: %1$@ 出

# logs.compact.prefix
source: Tok
zh_hans: 令牌

# logs.compact.total
source: %1$@ total
zh_hans: %1$@ 总

# logs.count.loaded
source: Loaded %lld
zh_hans: 已加载 %lld 条

# logs.count.loaded_requests
source: Loaded %lld requests
zh_hans: 已加载 %lld 条请求

# logs.count.more_available
source: More available
zh_hans: 还有更多

# logs.detail.error
source: Error
zh_hans: 错误

# logs.detail.error_stage
source: Error Stage
zh_hans: 错误阶段

# logs.detail.error_type
source: Error Type
zh_hans: 错误类型

# logs.detail.first_byte
source: First Byte
zh_hans: 首字节

# logs.detail.protocol
source: Protocol
zh_hans: 协议

# logs.detail.request_id
source: Request ID
zh_hans: 请求 ID

# logs.detail.stream
source: Stream
zh_hans: 流式

# logs.detail.tokens
source: Tokens
zh_hans: 令牌

# logs.empty.filtered
source: No request logs match current filters.
zh_hans: 当前筛选条件下没有请求日志。

# logs.filter.clear
source: Clear Filters
zh_hans: 清空筛选

# logs.filter.gateway
source: Gateway
zh_hans: 网关

# logs.filter.only_errors
source: Only Errors
zh_hans: 仅错误

# logs.filter.provider
source: Provider
zh_hans: 供应商

# logs.filter.status
source: Status
zh_hans: 状态

# logs.filters.clear
source: Clear Filters
zh_hans: 清空筛选

# logs.filters.errors_only
source: Only Errors
zh_hans: 仅错误

# logs.filters.loaded_count
source: Loaded %lld
zh_hans: 已加载 %lld 条

# logs.filters.loaded_requests
source: Loaded %lld requests
zh_hans: 已加载 %lld 条请求

# logs.filters.more_available
source: More available
zh_hans: 还有更多

# logs.filters.status
source: Status
zh_hans: 状态

# logs.filters.title
source: Log Filters
zh_hans: 日志筛选

# logs.section.diagnostics
source: Diagnostics
zh_hans: 诊断信息

# logs.section.execution
source: Execution
zh_hans: 执行信息

# logs.section.usage_json
source: Usage JSON
zh_hans: 用量 JSON

# logs.sections.diagnostics
source: Diagnostics
zh_hans: 诊断

# logs.sections.execution
source: Execution
zh_hans: 执行

# logs.sections.request_stream
source: Request Stream
zh_hans: 请求流

# logs.sections.usage_json
source: Usage JSON
zh_hans: 用量 JSON

# logs.stream.empty
source: No request logs match current filters.
zh_hans: 当前筛选条件下没有请求日志。

# logs.stream.non_stream
source: Non-stream
zh_hans: 非流式

# logs.stream.streaming
source: Streaming
zh_hans: 流式

# logs.stream.title
source: Request Stream
zh_hans: 请求流

# overview.gateway_status.healthy
source: Healthy
zh_hans: 健康

# overview.gateway_status.idle
source: Idle
zh_hans: 空闲

# overview.logs.open
source: Open Logs
zh_hans: 打开日志

# overview.logs.open_all
source: Open All Logs
zh_hans: 打开全部日志

# overview.metric.connections
source: Connections
zh_hans: 连接数

# overview.metric.errors
source: Errors
zh_hans: 错误

# overview.metric.internet
source: Internet
zh_hans: 网络

# overview.metric.successful
source: Successful
zh_hans: 成功

# overview.metric.total_requests
source: Total Requests
zh_hans: 总请求数

# overview.network.no_gateway
source: No gateway
zh_hans: 无网关

# overview.page.title
source: Overview
zh_hans: 概览

# overview.section.network_status
source: Network Status
zh_hans: 网络状态

# overview.section.recent_requests
source: Recent Requests
zh_hans: 最近请求

# overview.section.running_status
source: Running Status
zh_hans: 运行状态

# overview.section.traffic_summary
source: Traffic Summary
zh_hans: 流量概览

# overview.state.empty
source: No recent traffic yet.
zh_hans: 最近还没有流量。

# overview.state.loading
source: Loading overview...
zh_hans: 正在加载概览...

# overview.status.errors
source: Errors %lld
zh_hans: 错误 %lld

# placeholder.route_map.message
source: Route map visualization will be added in the redesigned native workbench.
zh_hans: Route Map 可视化将在重设计后的原生工作台中补齐。

# provider_form.action.create
source: Create Provider
zh_hans: 新建 Provider

# provider_form.action.hide
source: Hide
zh_hans: 隐藏

# provider_form.action.reveal
source: Reveal
zh_hans: 显示

# provider_form.field.api_key.caption
source: Stored locally and used for upstream authentication.
zh_hans: 本地保存，用于上游鉴权。

# provider_form.field.base_url
source: Base URL
zh_hans: 基础 URL

# provider_form.field.base_url.caption
source: Use a full upstream endpoint, including the version path when needed.
zh_hans: 填写完整的上游端点；需要时请包含版本路径。

# provider_form.field.display_name
source: Display Name
zh_hans: 显示名称

# provider_form.field.kind
source: Kind
zh_hans: 类型

# provider_form.field.kind.caption
source: Choose one of the supported upstream provider types.
zh_hans: 选择受支持的上游 Provider 类型。

# provider_form.field.provider_id.caption_create
source: Stable routing key used across gateways.
zh_hans: 在各个 Gateway 之间使用的稳定路由键。

# provider_form.field.provider_id.caption_edit
source: Locked after creation to keep downstream routes stable.
zh_hans: 创建后锁定，保持下游路由稳定。

# provider_form.footer.create
source: Create a reusable upstream profile
zh_hans: 创建可复用的上游配置

# provider_form.footer.update
source: Update provider routing configuration
zh_hans: 更新 Provider 路由配置

# provider_form.header.create
source: Create Provider
zh_hans: 新建 Provider

# provider_form.header.edit
source: Configure Provider
zh_hans: 配置 Provider

# provider_form.header.subtitle
source: Manage upstream endpoint, API key and model routing in one compact control surface.
zh_hans: 在一个紧凑的控制面板中管理上游端点、API Key 和模型路由。

# provider_form.kind.unsupported_current_value
source: Unsupported current value: %1$@
zh_hans: 当前值不受支持：%1$@

# provider_form.meta.auth
source: Auth
zh_hans: 鉴权

# provider_form.meta.auth_configured
source: Configured
zh_hans: 已配置

# provider_form.meta.auth_missing
source: Missing
zh_hans: 缺失

# provider_form.meta.models
source: Models
zh_hans: 模型数

# provider_form.meta.status
source: Status
zh_hans: 状态

# provider_form.meta.status_active
source: Active
zh_hans: 启用

# provider_form.meta.status_disabled
source: Disabled
zh_hans: 停用

# provider_form.metric.auth
source: Auth
zh_hans: 鉴权

# provider_form.metric.auth_off
source: Off
zh_hans: 关

# provider_form.metric.auth_on
source: On
zh_hans: 开

# provider_form.metric.kind
source: Kind
zh_hans: 类型

# provider_form.metric.models
source: Models
zh_hans: 模型

# provider_form.models.caption
source: List one or multiple models. Separate by comma or line break.
zh_hans: 填写一个或多个模型，使用逗号或换行分隔。

# provider_form.models.count.one
source: %lld model configured
zh_hans: 已配置 %lld 个模型

# provider_form.models.count.other
source: %lld models configured
zh_hans: 已配置 %lld 个模型

# provider_form.models.disabled
source: Disabled from routing
zh_hans: 已停止参与路由

# provider_form.models.ready
source: Ready for routing
zh_hans: 可参与路由

# provider_form.runtime.routing_disabled
source: Routing disabled
zh_hans: 路由已关闭

# provider_form.runtime.routing_enabled
source: Routing enabled
zh_hans: 路由已开启

# provider_form.runtime.snapshot_caption
source: Quick state snapshot for this upstream profile.
zh_hans: 当前上游配置的快速状态快照。

# provider_form.section.connection
source: Connection
zh_hans: 连接

# provider_form.section.identity
source: Identity
zh_hans: 标识

# provider_form.section.models
source: Models
zh_hans: 模型

# provider_form.section.runtime
source: Runtime
zh_hans: 运行时

# provider_form.status.disabled
source: Disabled
zh_hans: 停用

# provider_form.status.enabled
source: Enabled
zh_hans: 启用

# provider_form.summary.no_endpoint
source: No endpoint configured
zh_hans: 未配置端点

# provider_form.summary.profile
source: Provider Profile
zh_hans: Provider 配置

# provider_form.summary.snapshot
source: Provider Snapshot
zh_hans: Provider 快照

# provider_form.summary.untitled
source: Untitled Provider
zh_hans: 未命名 Provider

# provider_form.toggle.enabled
source: Enabled
zh_hans: 启用

# provider_form.validation.id_required
source: ID is required.
zh_hans: ID 为必填项。

# provider_form.validation.invalid_base_url
source: Base URL must be a valid URL.
zh_hans: 基础 URL 必须是合法 URL。

# provider_form.validation.model_required
source: At least one model is required.
zh_hans: 至少需要一个模型。

# provider_form.validation.required_fields
source: Name, Kind, Base URL and API Key are required.
zh_hans: 名称、类型、基础 URL 和 API Key 为必填项。

# provider_form.validation.review
source: Please review the highlighted configuration before saving.
zh_hans: 保存前请检查高亮的配置项。

# provider_form.validation.unsupported_kind
source: Choose one of the supported provider kinds.
zh_hans: 请选择受支持的 Provider 类型。

# provider_kind.anthropic.inbound_subtitle
source: Anthropic messages ingress
zh_hans: Anthropic Messages 入口

# provider_kind.anthropic.upstream_subtitle
source: Forward using Anthropic upstream
zh_hans: 使用 Anthropic 上游转发

# provider_kind.azure_openai.inbound_subtitle
source: Azure OpenAI-compatible ingress
zh_hans: Azure OpenAI 兼容入口

# provider_kind.azure_openai.upstream_subtitle
source: Forward using Azure OpenAI-compatible upstream
zh_hans: 使用 Azure OpenAI 兼容上游转发

# provider_kind.gemini.inbound_subtitle
source: Gemini-compatible client ingress
zh_hans: Gemini 兼容客户端入口

# provider_kind.gemini.upstream_subtitle
source: Forward using Gemini-compatible upstream
zh_hans: 使用 Gemini 兼容上游转发

# provider_kind.new_api.inbound_subtitle
source: New API-compatible client ingress
zh_hans: New API 兼容客户端入口

# provider_kind.new_api.upstream_subtitle
source: Forward using New API-compatible upstream
zh_hans: 使用 New API 兼容上游转发

# provider_kind.ollama.inbound_subtitle
source: Ollama-compatible client ingress
zh_hans: Ollama 兼容客户端入口

# provider_kind.ollama.upstream_subtitle
source: Forward using Ollama-compatible upstream
zh_hans: 使用 Ollama 兼容上游转发

# provider_kind.openai_response.inbound_subtitle
source: OpenAI Responses / Codex-style ingress
zh_hans: OpenAI Responses / Codex 风格入口

# provider_kind.openai_response.upstream_subtitle
source: Forward using OpenAI Responses-compatible upstream
zh_hans: 使用 OpenAI Responses 兼容上游转发

# provider_kind.openai.inbound_subtitle
source: OpenAI-compatible client ingress
zh_hans: OpenAI 兼容客户端入口

# provider_kind.openai.upstream_subtitle
source: Forward using OpenAI-compatible upstream
zh_hans: 使用 OpenAI 兼容上游转发

# provider.action.new
source: New Provider
zh_hans: 新建供应商

# provider.empty.message
source: Create a provider to route gateway traffic.
zh_hans: 创建供应商以承接网关流量。

# provider.empty.title
source: No providers
zh_hans: 暂无供应商

# provider.page.title
source: Providers
zh_hans: 供应商

# provider.state.loading
source: Loading providers...
zh_hans: 正在加载供应商...

# provider.state.submitting
source: Submitting provider...
zh_hans: 正在提交供应商...

# providers.actions.configure
source: Configure
zh_hans: 配置

# providers.actions.delete
source: Delete
zh_hans: 删除

# providers.actions.new
source: New Provider
zh_hans: 新建 Provider

# providers.actions.probe
source: Probe
zh_hans: 探测

# providers.actions.submitting
source: Submitting provider...
zh_hans: 正在提交 Provider...

# providers.fields.endpoint
source: Endpoint
zh_hans: 端点

# providers.fields.health
source: Health
zh_hans: 健康状态

# providers.fields.last_failure
source: Last Failure
zh_hans: 最近失败

# providers.fields.models
source: Models
zh_hans: 模型

# providers.list.empty.message
source: Create a provider to route gateway traffic.
zh_hans: 创建 Provider 以承接 Gateway 流量。

# providers.list.empty.title
source: No providers
zh_hans: 暂无 Provider

# providers.list.loading
source: Loading providers...
zh_hans: 正在加载供应商...

# resource.gateway.action.start
source: Start
zh_hans: 启动

# resource.gateway.action.stop
source: Stop
zh_hans: 停止

# resource.gateway.auto_start.off
source: OFF
zh_hans: 关闭

# resource.gateway.auto_start.on
source: ON
zh_hans: 开启

# resource.gateway.runtime.error
source: Error
zh_hans: 错误

# resource.gateway.runtime.running
source: Running
zh_hans: 运行中

# resource.gateway.runtime.stopped
source: Stopped
zh_hans: 已停止

# resource.gateway.runtime.unknown
source: Unknown
zh_hans: 未知

# resource.health.degraded
source: Degraded
zh_hans: 降级

# resource.health.healthy
source: Healthy
zh_hans: 健康

# resource.health.probing
source: Probing
zh_hans: 探测中
